{
    "Reference name is not known": "Referenz ist nicht bekannt",
    "You either reference a non-existing identifier or a identifier that is not in scope": "Sie verweisen entweder auf einen nicht vorhandenen Bezeichner oder auf einen Bezeichner, der nicht im Geltungsbereich liegt",
    "Reference in function calls need to start with an ampersand": "Referenz in Funktionsaufrufen muss mit einrm & beginnen",
    "Reference in function calls need to be parenthesized": "Referenz in Funktionsaufrufen muss in Klammern stehen",
    "Invalid argument type, expected Reference(&) or Number. Got {0}": "Ungültiger Argumenttyp, erwartet wird Referenz(&) oder Zahl. Erhalten wurde {0}",
    "Expected right brace but found end of file": "Erwartetet wurde eine rechte geschweifte Klammer, aber Dateiende gefunden",
    "Expected right brace to close the object": "Erwartetet wurde eine rechte geschweifte Klammer, um das Objekt zu schließen",
    "Not expected right brace, did you mean to open an object?": "Nicht erwartete rechte geschweifte Klammer, meinten Sie, ein Objekt zu öffnen?",
    "Expected right bracket but found end of file": "Erwartetet wurde eine rechte eckige Klammer, aber Dateiende gefunden",
    "Expected right bracket to close the array": "Erwartetet wurde eine rechte eckige Klammer, um das Array zu schließen",
    "Not expected bracket, did you mean to open an array?": "Nicht erwartete eckige Klammer, meinten Sie, ein Array zu öffnen?",
    "Not expected comma": "Nicht erwartetes Komma",
    "Expected right paren for reference": "Erwartetet wurde eine rechte Klammer für die Referenz",
    "Expected value, expression or function call": "Erwartetet wurde ein Wert, ein Ausdruck oder ein Funktionsaufruf",
    "Values can be a number or a reference, expressions can be +, -, *, /": "Werte können eine Zahl oder eine Referenz sein, Ausdrücke können +, -, *, / sein",
    "Expected value after left paren": "Erwartetet wurde ein Wert nach der linken Klammer",
    "Expected value after equals": "Erwartetet wurde ein Wert nach dem Gleichheitszeichen",
    "If you want to assign a value to an identifier, you need to provide a value after the equals sign": "Wenn Sie einem Bezeichner einen Wert zuweisen möchten, müssen Sie einen Wert nach dem Gleichheitszeichen angeben",
    "If you want to not assign a value to an identifier, you need to remove the equals sign": "Wenn Sie einem Bezeichner keinen Wert zuweisen möchten, müssen Sie das Gleichheitszeichen entfernen",
    "Expected value in colon": "Erwartetet wurde ein Wert im Doppelpunkt",
    "Those Values should be a References with & or beginning with /": "Diese Werte sollten Referenzen mit & oder mit / beginnen",
    "Expected value after value but found {0}": "Erwartetet wurde ein Wert nach dem Wert, aber {0} gefunden",
    "Not expected paren": "Nicht erwartete Klammer",
    "Unknown token type": "Unbekannter Token-Typ",
    "This could be a bug in the parser or lexer, please report this issue, if you think this is a bug": "Dies könnte ein Fehler im Parser oder Lexer sein, bitte melden Sie dieses Problem, wenn Sie denken, dass dies ein Fehler ist"
}
